tests/cassettes/ChargeTest.test_charge_create__stolen_card__visa.yaml

interactions:
- request:
    body: '{"card_number": "4000020000000000", "expiration_month": "10", "expiration_year":
      "2025", "cvv": "354", "email": "richard@piedpiper.com"}'
    headers:
      Accept:
      - application/json
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Bearer culiq_api_key
      Connection:
      - keep-alive
      Content-Length:
      - '136'
      Content-type:
      - application/json
      User-Agent:
      - Culqi-API-Python/1.0.4
    method: POST
    uri: https://secure.culqi.com/v2/tokens
  response:
    body:
      string: "{\"object\":\"token\",\"id\":\"tkn_test_ytPrzKnzUVvcwnY8\",\"type\"\
        :\"card\",\"creation_date\":1589954388000,\"email\":\"richard@piedpiper.com\"\
        ,\"card_number\":\"400002******0000\",\"last_four\":\"0000\",\"active\":true,\"\
        iin\":{\"object\":\"iin\",\"bin\":\"400002\",\"card_brand\":\"Visa\",\"card_type\"\
        :\"credito\",\"card_category\":\"Cl\xE1sica\",\"issuer\":{\"name\":\"RIVER\
        \ VALLEY C.U.\",\"country\":\"UNITED STATES\",\"country_code\":\"US\",\"website\"\
        :null,\"phone_number\":null},\"installments_allowed\":[]},\"client\":{\"ip\"\
        :\"190.237.22.191\",\"ip_country\":\"Peru\",\"ip_country_code\":\"PE\",\"\
        browser\":\"UNKNOWN\",\"device_fingerprint\":null,\"device_type\":\"Escritorio\"\
        },\"metadata\":{}}"
    headers:
      Connection:
      - keep-alive
      Content-Encoding:
      - UTF-8
      Content-Length:
      - '608'
      Content-Type:
      - application/json;charset=UTF-8
      Date:
      - Wed, 20 May 2020 05:59:49 GMT
      Via:
      - 1.1 c46150c601905fd316c924fd100bc1e7.cloudfront.net (CloudFront)
      X-Amz-Cf-Id:
      - DA0GApGv9sGp2wKXzwrLxcCSl6EMPFAvojUqBj3RMmcjzXjzYZWQMw==
      X-Amz-Cf-Pop:
      - SCL50-C1
      X-Amzn-Trace-Id:
      - Root=1-5ec4c754-b90e20948d4b9d12cd3463b0;Sampled=0
      X-Cache:
      - Miss from cloudfront
      x-amz-apigw-id:
      - M0QVPG8QoAMFyNA=
      x-amzn-Remapped-Content-Length:
      - '608'
      x-amzn-RequestId:
      - 2120fa5f-556b-476f-9ec2-2e953b0cac13
    status:
      code: 201
      message: Created
- request:
    body: '{"amount": 1000, "capture": false, "currency_code": "PEN", "description":
      "Venta de prueba", "email": "richard@piedpiper.com", "installments": 0, "source_id":
      "tkn_test_ytPrzKnzUVvcwnY8"}'
    headers:
      Accept:
      - application/json
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Bearer culiq_api_key
      Connection:
      - keep-alive
      Content-Length:
      - '187'
      Content-type:
      - application/json
      User-Agent:
      - Culqi-API-Python/1.0.4
    method: POST
    uri: https://api.culqi.com/v2/charges
  response:
    body:
      string: "{\"object\":\"error\",\"type\":\"card_error\",\"charge_id\":\"chr_test_3wH6IJLtZbKBdk0l\"\
        ,\"code\":\"card_declined\",\"decline_code\":\"stolen_card\",\"merchant_message\"\
        :\"Tarjeta robada. La tarjeta fue bloqueada y reportada al banco emisor como\
        \ una tarjeta robada.\",\"user_message\":\"Su tarjeta est\xE1 vencida. Verifica\
        \ la fecha de vencimiento de tu tarjeta e ingr\xE9salos correctamente. Si\
        \ es denegada nuevamente, cont\xE1ctate con el banco emisor de tu tarjeta.\"\
        }"
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '438'
      Content-Type:
      - application/json;charset=UTF-8
      Date:
      - Wed, 20 May 2020 05:59:52 GMT
      Via:
      - 1.1 251d722e3d568afacb1911e219d34f4d.cloudfront.net (CloudFront)
      X-Amz-Cf-Id:
      - jPOJ66ndbmct7PpUn7CqYzj79a_XqUfUOBlY7nwDu7RgDaBdenyldQ==
      X-Amz-Cf-Pop:
      - SCL50-C1
      X-Amzn-Trace-Id:
      - Root=1-5ec4c756-8ccda79b5cefab67f536f28d;Sampled=0
      X-Cache:
      - Error from cloudfront
      set-cookie:
      - JSESSIONID=01DB5E0D38268118118CDF69456ABF5F; Path=/api; HttpOnly
      x-amz-apigw-id:
      - M0QVdHmWIAMFVfg=
      x-amzn-RequestId:
      - 2657c79a-d907-4f31-afd2-4f5e57b3decd
      x-culqi-environment:
      - test
      x-culqi-tracking-id:
      - '7213329'
      x-culqi-version:
      - 2.0.0
    status:
      code: 402
      message: Payment Required
version: 1
